nxp-mcuxpresso/mcux-sdk/components/power_manager/devices/MCXN947/fsl_pm_device.c
    /* Get the SRAM resc number */
    sramId = pResourceRecode - &(resourceDB[0]);
    assert(sramId >= kResc_SRAM_RAMA0_8K);
    assert(sramId <= kResc_SRAM_FLEXSPI0);

    if (sramId <= kResc_SRAM_RAMA3_8K)
    {
        sramId -= (uint8_t)kResc_SRAM_RAMA0_8K;
        sramId = 1U << sramId;

        switch (operateMode)
        {
            case PM_RESOURCE_FULL_ON:
            {
                break;
            }

            case PM_RESOURCE_PARTABLE_ON1:
            {
                VBAT_RetainSRAMsInLowPowerModes(VBAT0, sramId);
                break;
            }

            case PM_RESOURCE_OFF:
            {
                VBAT_PowerOffSRAMsInLowPowerModes(VBAT0, sramId);
                break;
            }

            default:
            {
                assert(0U);
                break;
            }
        }
    }
    else
    {
        if (sramId >= kResc_SRAM_LPCAC)
        {
            sramId += 9U;
        }
        /* Calculate the bit shift value for SRAMDIS/SRAMRET registers */
        sramId -= (uint8_t)kResc_SRAM_RAMX0_32K;
        sramId = 1U << sramId;

        switch (operateMode)
        {
            case PM_RESOURCE_FULL_ON:
            {
                CMC0->SRAMDIS[0] &= ~sramId;
                break;
            }

            case PM_RESOURCE_PARTABLE_ON1:
            {
                CMC0->SRAMDIS[0] &= ~sramId;
                CMC0->SRAMRET[0] &= ~sramId;
                break;
            }

            case PM_RESOURCE_OFF:
            {
                CMC_PowerOffSRAMAllMode(CMC0, sramId | CMC0->SRAMDIS[0]);
                break;
            }

            default:
            {
                assert(0U);
                break;
            }
        }
    }

    pResourceRecode->currentOperateMode = operateMode;
}

static void SetAnalogOperateMode(uint8_t operateMode, resource_recode_t *pResourceRecode)
{
    assert(pResourceRecode);

    uint8_t analogId;

    /* Get the analog module resc number */
    analogId = pResourceRecode - &(resourceDB[0]);
    assert(analogId >= kResc_VREF);
    assert(analogId <= kResc_CMP2);

    switch (analogId)
    {
        case kResc_VREF:
            if (operateMode == PM_RESOURCE_FULL_ON)
            {
                CLOCK_EnableClock(kCLOCK_Vref);
                SPC_EnableActiveModeAnalogModules(SPC0, kSPC_controlVref);
                SPC_EnableLowPowerModeAnalogModules(SPC0, kSPC_controlVref);
                /* Note: The user could add xxx IP Init function here. */
            }
            else
            {
                CLOCK_DisableClock(kCLOCK_Vref);
                SPC_DisableActiveModeAnalogModules(SPC0, kSPC_controlVref);
                SPC_DisableLowPowerModeAnalogModules(SPC0, kSPC_controlVref);
                /* Note: The user could add xxx IP DeInit function here. */
            }
            break;

        case kResc_USB3V_DET:
            if (operateMode == PM_RESOURCE_FULL_ON)
            {
                SPC_EnableActiveModeAnalogModules(SPC0, kSPC_controlUsb3vDet);
                SPC_EnableLowPowerModeAnalogModules(SPC0, kSPC_controlUsb3vDet);
            }
            else
            {
                SPC_DisableActiveModeAnalogModules(SPC0, kSPC_controlUsb3vDet);
                SPC_DisableLowPowerModeAnalogModules(SPC0, kSPC_controlUsb3vDet);
            }
            break;

        case kResc_DAC0:
            if (operateMode == PM_RESOURCE_FULL_ON)
            {
                CLOCK_EnableClock(kCLOCK_Dac0);
                SPC_EnableActiveModeAnalogModules(SPC0, kSPC_controlDac0);
                SPC_EnableLowPowerModeAnalogModules(SPC0, kSPC_controlDac0);
            }
            else
            {
                CLOCK_DisableClock(kCLOCK_Dac0);
                SPC_DisableActiveModeAnalogModules(SPC0, kSPC_controlDac0);
                SPC_DisableLowPowerModeAnalogModules(SPC0, kSPC_controlDac0);
            }
            break;

        case kResc_DAC1:
            if (operateMode == PM_RESOURCE_FULL_ON)
            {
                CLOCK_EnableClock(kCLOCK_Dac1);
                SPC_EnableActiveModeAnalogModules(SPC0, kSPC_controlDac1);
                SPC_EnableLowPowerModeAnalogModules(SPC0, kSPC_controlDac1);
            }
            else
            {
                CLOCK_DisableClock(kCLOCK_Dac1);
                SPC_DisableActiveModeAnalogModules(SPC0, kSPC_controlDac1);
                SPC_DisableLowPowerModeAnalogModules(SPC0, kSPC_controlDac1);
            }
            break;

        case kResc_DAC2:
            if (operateMode == PM_RESOURCE_FULL_ON)
            {
                CLOCK_EnableClock(kCLOCK_Dac2);
                SPC_EnableActiveModeAnalogModules(SPC0, kSPC_controlDac2);
                SPC_EnableLowPowerModeAnalogModules(SPC0, kSPC_controlDac2);
            }
            else
            {
                CLOCK_DisableClock(kCLOCK_Dac2);
                SPC_DisableActiveModeAnalogModules(SPC0, kSPC_controlDac2);
                SPC_DisableLowPowerModeAnalogModules(SPC0, kSPC_controlDac2);
            }
            break;

        case kResc_OPAMP0:
            if (operateMode == PM_RESOURCE_FULL_ON)
            {
                CLOCK_EnableClock(kCLOCK_Opamp0);
                SPC_EnableActiveModeAnalogModules(SPC0, kSPC_controlOpamp0);
                SPC_EnableLowPowerModeAnalogModules(SPC0, kSPC_controlOpamp0);
            }
            else
            {
                CLOCK_DisableClock(kCLOCK_Opamp0);
                SPC_DisableActiveModeAnalogModules(SPC0, kSPC_controlOpamp0);
                SPC_DisableLowPowerModeAnalogModules(SPC0, kSPC_controlOpamp0);
            }
            break;

        case kResc_OPAMP1:
            if (operateMode == PM_RESOURCE_FULL_ON)
            {
                CLOCK_EnableClock(kCLOCK_Opamp1);
                SPC_EnableActiveModeAnalogModules(SPC0, kSPC_controlOpamp1);
                SPC_EnableLowPowerModeAnalogModules(SPC0, kSPC_controlOpamp1);
            }
            else
            {
                CLOCK_DisableClock(kCLOCK_Opamp1);
                SPC_DisableActiveModeAnalogModules(SPC0, kSPC_controlOpamp1);
                SPC_DisableLowPowerModeAnalogModules(SPC0, kSPC_controlOpamp1);
            }
            break;

